GreatCowBASIC/DATFileGenerator/incfiles/p18F24Q24.inc
;----- I2C1STAT1 Bits -----------------------------------------------------
RXBF             EQU  H'0000'
CLRBF            EQU  H'0002'
RXRE             EQU  H'0003'
TXBE             EQU  H'0005'
TXWE             EQU  H'0007'


;----- I2C1PIR Bits -----------------------------------------------------
SCIF             EQU  H'0000'
RSCIF            EQU  H'0001'
PCIF             EQU  H'0002'
ADRIF            EQU  H'0003'
WRIF             EQU  H'0004'
ACKTIF           EQU  H'0006'
CNTIF            EQU  H'0007'
SC1IF            EQU  H'0000'
RSC1IF           EQU  H'0001'
PC1IF            EQU  H'0002'
ADR1IF           EQU  H'0003'
WR1IF            EQU  H'0004'
ACKT1IF          EQU  H'0006'
CNT1IF           EQU  H'0007'


;----- I2C1PIE Bits -----------------------------------------------------
SCIE             EQU  H'0000'
RSCIE            EQU  H'0001'
PCIE             EQU  H'0002'
ADRIE            EQU  H'0003'
WRIE             EQU  H'0004'
ACKTIE           EQU  H'0006'
CNTIE            EQU  H'0007'
SC1IE            EQU  H'0000'
RSC1IE           EQU  H'0001'
PC1IE            EQU  H'0002'
ADR1IE           EQU  H'0003'
WR1IE            EQU  H'0004'
ACKT1IE          EQU  H'0006'
CNT1IE           EQU  H'0007'


;----- I2C1BTO Bits -----------------------------------------------------
TOTIME0          EQU  H'0000'
TOTIME1          EQU  H'0001'
TOTIME2          EQU  H'0002'
TOTIME3          EQU  H'0003'
TOTIME4          EQU  H'0004'
TOTIME5          EQU  H'0005'
TOBY32           EQU  H'0006'
TOREC            EQU  H'0007'
TOTIME0          EQU  H'0000'
TOTIME1          EQU  H'0001'
TOTIME2          EQU  H'0002'
TOTIME3          EQU  H'0003'
TOTIME4          EQU  H'0004'
TOTIME5          EQU  H'0005'


;----- I2C1BAUD Bits -----------------------------------------------------


;----- I2C1CLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
I2CCLK0          EQU  H'0000'
I2CCLK1          EQU  H'0001'
I2CCLK2          EQU  H'0002'
I2CCLK3          EQU  H'0003'
I2CCLK4          EQU  H'0004'


;----- I2C1BTOC Bits -----------------------------------------------------
BTOC0            EQU  H'0000'
BTOC1            EQU  H'0001'
BTOC2            EQU  H'0002'
BTOC3            EQU  H'0003'
I2CBTOC0         EQU  H'0000'
I2CBTOC1         EQU  H'0001'
I2CBTOC2         EQU  H'0002'
I2CBTOC3         EQU  H'0003'


;----- I2C2RXB Bits -----------------------------------------------------


;----- I2C2TXB Bits -----------------------------------------------------


;----- I2C2CNT Bits -----------------------------------------------------
CNT0             EQU  H'0000'
CNT1             EQU  H'0001'
CNT2             EQU  H'0002'
CNT3             EQU  H'0003'
CNT4             EQU  H'0004'
CNT5             EQU  H'0005'
CNT6             EQU  H'0006'
CNT7             EQU  H'0007'
I2C2CNT0         EQU  H'0000'
I2C2CNT1         EQU  H'0001'
I2C2CNT2         EQU  H'0002'
I2C2CNT3         EQU  H'0003'
I2C2CNT4         EQU  H'0004'
I2C2CNT5         EQU  H'0005'
I2C2CNT6         EQU  H'0006'
I2C2CNT7         EQU  H'0007'


;----- I2C2CNTH Bits -----------------------------------------------------
CNT8             EQU  H'0000'
CNT9             EQU  H'0001'
CNT10            EQU  H'0002'
CNT11            EQU  H'0003'
CNT12            EQU  H'0004'
CNT13            EQU  H'0005'
CNT14            EQU  H'0006'
CNT15            EQU  H'0007'
I2C2CNT8         EQU  H'0000'
I2C2CNT9         EQU  H'0001'
I2C2CNT10        EQU  H'0002'
I2C2CNT11        EQU  H'0003'
I2C2CNT12        EQU  H'0004'
I2C2CNT13        EQU  H'0005'
I2C2CNT14        EQU  H'0006'
I2C2CNT15        EQU  H'0007'


;----- I2C2ADB0 Bits -----------------------------------------------------


;----- I2C2ADB1 Bits -----------------------------------------------------


;----- I2C2ADR0 Bits -----------------------------------------------------


;----- I2C2ADR1 Bits -----------------------------------------------------
ADR0             EQU  H'0001'
ADR1             EQU  H'0002'
ADR2             EQU  H'0003'
ADR3             EQU  H'0004'
ADR4             EQU  H'0005'
ADR5             EQU  H'0006'
ADR6             EQU  H'0007'


;----- I2C2ADR2 Bits -----------------------------------------------------


;----- I2C2ADR3 Bits -----------------------------------------------------
ADR0             EQU  H'0001'
ADR1             EQU  H'0002'
ADR2             EQU  H'0003'
ADR3             EQU  H'0004'
ADR4             EQU  H'0005'
ADR5             EQU  H'0006'
ADR6             EQU  H'0007'


;----- I2C2CON0 Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MDR              EQU  H'0003'
CSTR             EQU  H'0004'
S                EQU  H'0005'
RSEN             EQU  H'0006'
EN               EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
I2CEN            EQU  H'0007'


;----- I2C2CON1 Bits -----------------------------------------------------
CSD              EQU  H'0000'
TXU              EQU  H'0001'
RXO              EQU  H'0002'
P                EQU  H'0003'
ACKT             EQU  H'0004'
ACKSTAT          EQU  H'0005'
ACKDT            EQU  H'0006'
ACKCNT           EQU  H'0007'


;----- I2C2CON2 Bits -----------------------------------------------------
BFRET0           EQU  H'0000'
BFRET1           EQU  H'0001'
SDAHT0           EQU  H'0002'
SDAHT1           EQU  H'0003'
ABD              EQU  H'0004'
GCEN             EQU  H'0006'
ACNT             EQU  H'0007'
BFRET0           EQU  H'0000'
BFRET1           EQU  H'0001'
SDAHT0           EQU  H'0002'
SDAHT1           EQU  H'0003'


;----- I2C2CON3 Bits -----------------------------------------------------
ACNTMD0          EQU  H'0000'
ACNTMD1          EQU  H'0001'
FME0             EQU  H'0002'
FME1             EQU  H'0003'
ACNTMD0          EQU  H'0000'
ACNTMD1          EQU  H'0001'
FME0             EQU  H'0002'
FME1             EQU  H'0003'


;----- I2C2ERR Bits -----------------------------------------------------
NACKIE           EQU  H'0000'
BCLIE            EQU  H'0001'
BTOIE            EQU  H'0002'
NACKIF           EQU  H'0004'
BCLIF            EQU  H'0005'
BTOIF            EQU  H'0006'
NACK2IE          EQU  H'0000'
BCL2IE           EQU  H'0001'
BTO2IE           EQU  H'0002'
NACK2IF          EQU  H'0004'
BCL2IF           EQU  H'0005'
BTO2IF           EQU  H'0006'


